In [1]:
import pandas as pd 
import glob 
import os

In [2]:
glob.glob('../aux_data/*edu*')

['../aux_data/edu_ind.csv',
 '../aux_data/edu_hh.dta',
 '../aux_data/edu_ind.dta',
 '../aux_data/edu_hh.csv']

In [3]:
hh_edu = pd.read_csv('../aux_data/edu_hh.csv')

In [4]:
ind_edu = pd.read_csv('../aux_data/edu_ind.csv')

In [5]:
hh_edu.describe()

,edu_hh_child613inschool,edu_hh_child1417inschool,edu_hh_girls613inschool,edu_hh_girls1417inschool,edu_hh_boys613inschool,edu_hh_boys1417inschool,edu_hh_headattain_yrs
count,208.000000,150.000000,140.000000,96.000000,139.000000,76.000000,292.000000
mean,0.879087,0.947778,0.875000,0.939236,0.856115,0.960526,8.260274
std,0.260201,0.208986,0.298628,0.229568,0.322250,0.196013,3.387981
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,7.000000
50%,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,8.000000
75%,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,12.000000
max,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,15.000000

In [6]:
hh_edu.columns

Index(['hh_ids', 'edu_hh_child613inschool', 'edu_hh_child1417inschool',
       'edu_hh_girls613inschool', 'edu_hh_girls1417inschool',
       'edu_hh_boys613inschool', 'edu_hh_boys1417inschool',
       'edu_hh_headattain_yrs'],
      dtype='object')

In [7]:
hh_edu.head()

,hh_ids,edu_hh_child613inschool,edu_hh_child1417inschool,edu_hh_girls613inschool,edu_hh_girls1417inschool,edu_hh_boys613inschool,edu_hh_boys1417inschool,edu_hh_headattain_yrs
0,KELDK01,1.0,NaN,1.0,NaN,NaN,NaN,8.0
1,KELDK02,NaN,1.0,NaN,1.0,NaN,NaN,8.0
2,KELDK08,0.0,NaN,NaN,NaN,0.0,NaN,5.0
3,KELDK09,1.0,NaN,1.0,NaN,NaN,NaN,10.0
4,KELDK10,NaN,NaN,NaN,NaN,NaN,NaN,10.0

In [8]:
ind_edu.columns

Index(['m_ids', 'hh_ids', 'edu_i_enrolled', 'edu_i_attain',
       'edu_i_attain_yrs'],
      dtype='object')

In [10]:
ind_edu.head()

,m_ids,hh_ids,edu_i_enrolled,edu_i_attain,edu_i_attain_yrs
0,56134390476100000,KELDK01,0.0,Primary (some or complete),8.0
1,56134390654900000,KELDK01,0.0,Secondary (some or complete),10.0
2,56134392820800000,KELDK01,1.0,Primary (some or complete),3.0
3,56134392826900000,KELDK01,0.0,No education,0.0
4,56134389503000000,KELDK02,0.0,Primary (some or complete),8.0

In [11]:
edu_hh_ind_merge = ind_edu.merge(hh_edu, 'left', ['hh_ids'])

In [12]:
edu_hh_ind_merge.head()

,m_ids,hh_ids,edu_i_enrolled,edu_i_attain,edu_i_attain_yrs,edu_hh_child613inschool,edu_hh_child1417inschool,edu_hh_girls613inschool,edu_hh_girls1417inschool,edu_hh_boys613inschool,edu_hh_boys1417inschool,edu_hh_headattain_yrs
0,56134390476100000,KELDK01,0.0,Primary (some or complete),8.0,1.0,NaN,1.0,NaN,NaN,NaN,8.0
1,56134390654900000,KELDK01,0.0,Secondary (some or complete),10.0,1.0,NaN,1.0,NaN,NaN,NaN,8.0
2,56134392820800000,KELDK01,1.0,Primary (some or complete),3.0,1.0,NaN,1.0,NaN,NaN,NaN,8.0
3,56134392826900000,KELDK01,0.0,No education,0.0,1.0,NaN,1.0,NaN,NaN,NaN,8.0
4,56134389503000000,KELDK02,0.0,Primary (some or complete),8.0,NaN,1.0,NaN,1.0,NaN,NaN,8.0

In [13]:
edu_hh_ind_merge.columns = ['m_ids', 'hh_ids', 'edu_i_enrolled', 'edu_i_attain', 'edu_i_attain_yrs',
       'edu_hh_child613inschool', 'edu_hh_child1417inschool',
       'edu_hh_girls613inschool', 'edu_hh_girls1417inschool',
       'edu_hh_boys613inschool', 'edu_hh_boys1417inschool',
       'edu_hh_headattain_yrs']

In [24]:
# os.makedirs('data_ind', exist_ok = True)

In [15]:
edu_hh_ind_merge.to_csv('edu_hh_ind_merge.csv')